package HomeWork;

public class Homemade {
    public static void main(String[] args){
//        int n = 5;
//        int t =  (n * (n + 1)) / 2;
//        System.out.println(t);
// Напишите функцию printPrimeNums, которая выведет на экран все простые числа
// в промежутке от 1 до 1000, каждое на новой строке.
//        for (int i = 2; i <=1000; i++) {
//            System.out.println(i);
//        }

//        int i, j;
//        boolean isprime;
//        for(i=2; i < 100; i++) {
//            isprime = true;
//            // проверить, делится ли число без остатка
//            for (j=2; j <= i/j; j++)
//                // если число делится без остатка, значит, оно не простое
//                if((i%j) == 0) isprime = false;
//            if (isprime)
//                System.out.println(i);
//        }

//        В методе calculate класса Calculator реализовать калькулятор, который будет
//        выполнять математические операции (+, -, *, /) над двумя целыми числами и возвращать результат вещественного типа.
// Задача решена, но здесь не идет


//        public double calculate(char op, int a, int b) {
//            int a = 7;
//            int b = 3;
//            char op = '+';
//
//            if (op == '+') {
//                return a + b;
//            } else if (op == '/') {
//                return a / b;
//            } else if (op == '-') {
//                return a - b;
//            } else if (op == '*') {
//                return a * b;
//            } else {
//                System.out.println("некорректный оператор:" + "'" + op + "'");
//                return -1;
//            }
//
//        }
//
    }

}




